# Structured Query Language (SQL)

## Where To Learn SQL

**1. SQLZoo: The Wikipedia of SQL Learning** https://sqlzoo.net/wiki/SQL_Tutorial

**2. SQLBolt**
https://sqlbolt.com/

## Database Management Systems (DBMS)

[Comparing MySQL, PostgreSQL, and MongoDB](https://vercel.com/guides/mysql-vs-postgresql-vs-mongodb)

**1. MySQL**

**2. PostgreSQL**

**3. InfluxDB**

**4. MongoDB**

## Process for planning and designing a database before you create the SQL Database and Tables

**1. Identify and understand the main objects in your project**

Define the columns, table names, data types, relationship between tables, 

Example:
* Machine name: Pump Test Bench
* Oil Temperature: °C
* Hydraulic System Pressure: bar
* Hydraulic System Flow Rate: l/min
* Electric Motor Speed: RPM
* Ambient Temperature: °C
* Humidity: rH
* Ambient Noise: 
* Vibration:

**2. Ask questions**

Example:
* What is the relationship between A and B?
* If A changes, does B stays the same or not?
* What is the impact?

**2. Sketch the tables**

Example:
* Lucid: https://www.lucidchart.com/pages/database-diagram/database-design
* Sqldbm: https://sqldbm.com/

**3. Draft the SQL statements that will create your database**

`CREATE TABLE, DROP TABLE, INSERT INTO, SELECT, JOIN, WHERE, `

To retrieve data from a SQL database, we need to write `SELECT` statements (referred to as *queries*).

Given a table of data, we can query for a specific columns:

`SELECT column, another_column, ... FROM mytable`

We can query all columns of data from a table:

`SELECT * FROM mytable`

To filter certain results from being returned, we need to use `WHERE` clause in the query.

`SELECT column, another_column, ... FROM mytable WHERE condition AND/OR another_condition AND/OR ...;`

Below are some useful operators to use for numerical data (integer or floating point)

In [12]:
import pandas as pd

pd.set_option("display.max_colwidth", 1)

data = [
("=, !=, <, <=, >, >=",	"Standard numerical operators",	"col_name != 4"),
("BETWEEN … AND …",	"Number is within range of two values (inclusive)",	"col_name BETWEEN 1.5 AND 10.5"),
("NOT BETWEEN … AND …",	"Number is not within range of two values (inclusive)",	"col_name NOT BETWEEN 1 AND 10"),
("IN (…)",	"Number exists in a list",	"col_name IN (2, 4, 6)"),
("NOT IN (…)",	"Number does not exist in a list", "col_name NOT IN (1, 3, 5)")
]

df = pd.DataFrame(data, columns=["Operator", "Condition", "SQL Example"])

df

,Operator,Condition,SQL Example
0,"=, !=, <, <=, >, >=",Standard numerical operators,col_name != 4
1,BETWEEN … AND …,Number is within range of two values (inclusive),col_name BETWEEN 1.5 AND 10.5
2,NOT BETWEEN … AND …,Number is not within range of two values (inclusive),col_name NOT BETWEEN 1 AND 10
3,IN (…),Number exists in a list,"col_name IN (2, 4, 6)"
4,NOT IN (…),Number does not exist in a list,"col_name NOT IN (1, 3, 5)"

Examples:

1. Find the temperature with a row **Id** of 6 --> `SELECT * FROM temp_table WHERE Id = 6;`

2. Find the price in the **year**s between 2000 and 2010 --> `SELECT * FROM sale_table WHERE year BETWEEN 2000 AND 2010;`

3. Find the price not in the **year**s between 2000 and 2010 --> `SELECT * FROM sale_table WHERE year NOT BETWEEN 2000 AND 2010;`

4. Find the first 5 hydraulic oil pressure and their timestamp --> `SELECT * FROM pressure_table WHERE Id BETWEEN 1 AND 5;`

When writing **WHERE** clauses with columns containing text data, SQL supports operators to do things like case-sensitive string comparison and wildcard pattern matching.

A few common text-data specific operators:

In [13]:
data = [
("=",	"Case sensitive exact string comparison (notice the single equals)",	"col_name = 'abc'"),
("!= or <>",	"Case sensitive exact string inequality comparison",	"col_name != 'abcd'"),
("LIKE",	"Case insensitive exact string comparison",	"col_name LIKE 'ABC'"),
("NOT LIKE",	"Case insensitive exact string inequality comparison",	"col_name NOT LIKE 'ABCD'"),
("%",	"Used anywhere in a string to match a sequence of zero or more characters (only with LIKE or NOT LIKE)",	"col_name LIKE '%AT%' (matches 'AT', 'ATTIC', 'CAT' or even 'BATS')"),
("_",	"Used anywhere in a string to match a single character (only with LIKE or NOT LIKE)",	"col_name LIKE 'AN_' (matches 'AND', but not 'AN')"),
("IN (…)",	"String exists in a list",	"col_name IN ('A', 'B', 'C')"),
("NOT IN (…)",	"String does not exist in a list",	"col_name NOT IN ('D', 'E', 'F')")
]

df = pd.DataFrame(data, columns=["Operator", "Condition", "SQL Example"])

df

,Operator,Condition,SQL Example
0,=,Case sensitive exact string comparison (notice the single equals),col_name = 'abc'
1,!= or <>,Case sensitive exact string inequality comparison,col_name != 'abcd'
2,LIKE,Case insensitive exact string comparison,col_name LIKE 'ABC'
3,NOT LIKE,Case insensitive exact string inequality comparison,col_name NOT LIKE 'ABCD'
4,%,Used anywhere in a string to match a sequence of zero or more characters (only with LIKE or NOT LIKE),"col_name LIKE '%AT%' (matches 'AT', 'ATTIC', 'CAT' or even 'BATS')"
5,_,Used anywhere in a string to match a single character (only with LIKE or NOT LIKE),"col_name LIKE 'AN_' (matches 'AND', but not 'AN')"
6,IN (…),String exists in a list,"col_name IN ('A', 'B', 'C')"
7,NOT IN (…),String does not exist in a list,"col_name NOT IN ('D', 'E', 'F')"

Examples:

1. Find only Toy Store movie --> `SELECT * FROM movies WHERE Title = "Toy Story";`

2. Find all the Toy Story movies --> `SELECT * FROM movies WHERE Title LIKE "Toy Story%";`

3. Find all the projects by Farees --> `SELECT * FROM projects WHERE Name = "FAREES";`

## Example in Python

In [2]:
# # Example 1 : Create an SQLite database to store our book data
# import sqlite3

# # create a SQLite database called "books-collection"
# db = sqlite3.connect("books-collection.db")

# # create a "cursor" to control our database. The cursor will be used to modify our SQLite database.
# cursor = db.cursor()

# # create a table called "books"
# # cursor.execute("CREATE TABLE books (id INTEGER PRIMARY KEY, title varchar(250) NOT NULL UNIQUE, author varchar(250) NOT NULL, rating FLOAT NOT NULL)")

# # insert data into the table 
# # NOTE: the create a table code above must be commented out before we insert data into the table
# cursor.execute("INSERT INTO books VALUES(2, 'Elon Musk', 'Ashlee Vance', '9.5')")
# db.commit()